{
  "comment": "use lead_name, med_name, and dep_name to insert the name of a cat with that rank",
  "event": "War",
  "trigger_events": [
    "The war with o_c_n has begun.",
    "Rising tensions have finally come to a breaking point, o_c_n has declared war against c_n.",
    "o_c_n declares war against c_n.",
    "After many moons of tensions between o_c_n and c_n, a formal war is declared by o_c_n's leader.",
    "A tension-thick air hangs low over the o_c_n border, until o_c_n's leader finally declares a war with c_n.",
    "A formal war with o_c_n was been declared by their leader, marking a major turning point in the two Clans' relationships.",
    "Fuelled by a simmering resentment, o_c_n initiates a war with c_n, determined to reclaim their disputed territory.",
    "Amidst growing tensions, o_c_n launches a preemptive strike against c_n, fearing an imminent threat to their Clan's existence.",
    "Despite med_name's protests, o_c_n's leader declares war on c_n."
  ],
  "progress_events": {
    "comment": [
      "a category is chosen randomly to affect the war once each moon.",
      "but there are plenty of more complex/in-depth moon events that also affect the war."
    ],
    "rel_up": [
      "Rumors are circulating that o_c_n wishes the war would end.",
      "o_c_n tires of the war, wishing for it to end.",
      "Mutual exhaustion between o_c_n and c_n pushes o_c_n to consider ending the war.",
      "Neither c_n nor o_c_n wishes to lose cats to the war; o_c_n seems to be considering peace.",
      "Murmurings of peace between c_n and o_c_n permeated the last Gathering.",
      "The other Clan leaders pushed o_c_n to make peace with c_n at the last Gathering.",
      "Seeking peace, o_c_n ponders an end to the war.",
      "In the midst of conflict, a spark of understanding flickers between o_c_n and c_n cats, hinting at a potential path to peace.",
      "Amidst turmoil, empathy blooms between the c_n guardian and the o_c_n leader, kindling hope for reconciliation beyond the battlefield.",
      "Among the Clans, a yearning for peace emerges, bridging divides and nurturing a shared hope for harmony.",
      "Hope finally begins to unite the members of c_n and o_c_n, fostering a shared vision of peace.",
      "At the half-moon meeting, med_name talks with o_c_n's medicine cat about ending the war."
    ],
    "neutral": [
      "War continues to rage between c_n and o_c_n.",
      "The war against o_c_n continues.",
      "c_n warriors plan new defence strategies for the war against o_c_n.",
      "c_n wishes the war with o_c_n would end.",
      "c_n cats reinforce the camp walls in anticipation of o_c_n attacks.",
      "c_n warriors evaluate their defence strategies for coming battles against o_c_n.",
      "The war with o_c_n is disrupting the daily lives of c_n's members, forcing them to adapt to new routines and living situations in order to better defend themselves.",
      "The cats of both Clans, o_c_n and c_n, don't know when or how to anticipate battles anymore, everything has just been developing into a haywire mess.",
      "The Clans tried to have a calm negotiation about the conflict at the last Gathering, but it lead nowhere except to a waste of time.",
      "Tension continues to hang thick over the two at-war Clans; o_c_n and c_n.",
      "c_n patrols begin to bristle with anxiety and anticipation when patrolling the o_c_n border.",
      "o_c_n recently lead out a surprise attack to claim c_n territory, but to no avail.",
      "The war shows no signs of stopping, the hostility from o_c_n towards c_n is still going strong."
    ],
    "rel_down": [
      "o_c_n has taken some of c_n's territory.",
      "War negotiations with o_c_n went badly at the last Gathering.",
      "The tension between c_n and o_c_n is palpable, with even the smallest actions potentially leading to violence.",
      "Any attempts at peace only seemed to make the whole war situation between c_n and o_c_n worse.",
      "The cats of o_c_n are still keen on battle, with no yearn for peace shown from them.",
      "lead_name is worryingly starting to notice how battles between o_c_n and c_n have been extremely aggressive recently.",
      "Glares of unfriendliness and aggression are given by o_c_n's cats at most patrol interactions between c_n and o_c_n.",
      "o_c_n's surprise attacks on c_n have been increasing significantly lately.",
      "Even small sparks of disagreement between o_c_n and c_n can set off a huge battle.",
      "o_c_n's cats can't stop themselves from instinctively unsheathing their claws upon encountering an c_n cat."
    ]
  },
  "conclusion_events": [
    "The war with o_c_n has finally ended.",
    "The cats of o_c_n finally agree to peace terms.",
    "A truce is called by o_c_n and the war between o_c_n and c_n is ended.",
    "With the many injuries both sides have suffered, o_c_n finally found common ground with c_n and ended the war.",
    "The dust has finally settled of the war between o_c_n and c_n.",
    "The leader of o_c_n has finally decided that for the well-being of both Clans, the war between o_c_n and c_n should come to an end now.",
    "After lots of bloodshed of both o_c_n and c_n cats, o_c_n has come to terms of peace.",
    "The battles between o_c_n and c_n have ceased, the war now finally coming to an end.",
    "o_c_n and c_n have had a long and complex past, but o_c_n has finally decided that it's time for their battles to come to an end.",
    "Many battles have been fought between o_c_n and c_n, but it's time for those to stop now.",
    "The cats of o_c_n have come to a realization that war isn't the best solution, deciding to end it now.",
    "The piercing war cries of o_c_n have turned into tired, lifeless mewls... And the cats of o_c_n and c_n are glad as the war finally comes to a close.",
    "The leader of o_c_n has come to terms about the war, deciding that it would best for all the cats of o_c_n and c_n if it was formally settled here.",
    "Remembering all the blood that was shed in the war, o_c_n has decided to finally settle it, once and for all.",
    "med_name could almost cry with relief when o_c_n's leader announces that they have agreed to peace terms."
  ]
}
